Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
/******************************************************************************
 * File Name: mqtt_iot_hub_pnp.c
 *
 * Description: This file contains tasks and functions related to Azure Plug and
 * Play feature task.
 *
 ********************************************************************************
 * (c) 2024-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG. All rights reserved.
 * This software, associated documentation and materials ("Software") is
 * owned by Infineon Technologies AG or one of its affiliates ("Infineon")
 * and is protected by and subject to worldwide patent protection, worldwide
 * copyright laws, and international treaty provisions. Therefore, you may use
 * this Software only as provided in the license agreement accompanying the
 * software package from which you obtained this Software. If no license
 * agreement applies, then any use, reproduction, modification, translation, or
 * compilation of this Software is prohibited without the express written
 * permission of Infineon.
 *
 * Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 * IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
 * THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
 * SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
 * Infineon reserves the right to make changes to the Software without notice.
 * You are responsible for properly designing, programming, and testing the
 * functionality and safety of your intended application of the Software, as
 * well as complying with any legal requirements related to its use. Infineon
 * does not guarantee that the Software will be free from intrusion, data theft
 * or loss, or other breaches ("Security Breaches"), and Infineon shall have
 * no liability arising out of any Security Breaches. Unless otherwise
 * explicitly approved by Infineon, the Software may not be used in any
 * application where a failure of the Product or any consequences of the use
 * thereof can reasonably be expected to result in personal injury.
 *******************************************************************************/

#include "azure_common.h"

#include <stdio.h>
#include "cybsp.h"
#include "cy_log.h"
#include <lwip/tcpip.h>
#include <lwip/api.h>
#include <cybsp_wifi.h>
#include "cy_nw_helper.h"
#include "cyabs_rtos.h"
#include <FreeRTOS.h>
#include <task.h>
#include "mqtt_main.h"
#include "cy_mqtt_api.h"
#include <az_core.h>
#include <az_iot.h>
#include "mqtt_iot_common.h"

/*******************************************************************************
 * Macros
 ********************************************************************************/
#define DEFAULT_START_TEMP_COUNT                    (1U)
#define DEFAULT_START_TEMP_CELSIUS                  (22.0)
#define DOUBLE_DECIMAL_PLACE_DIGITS                 (2U)

/* Wait duration between messages, should be in multiples of 500 */
#define MESSAGE_WAIT_LOOP_DURATION_MSEC             (500U * 500U)

#define SAS_KEY_DURATION_MINUTES                    (240U)
#define MQTT_CLIENT_ID_BUFFER_SIZE                  (128U)
#define CONNECTION_REQUEST_ID_BUFFER_SIZE           (16U)
#define COMMAND_START_TIME_VALUE_BUFFER_SIZE        (64U)
#define COMMAND_END_TIME_VALUE_BUFFER_SIZE          (64U)
#define COMMAND_RESPONSE_PAYLOAD_BUFFER_SIZE        (256U)
#define METHODS_RESPONSE_TOPIC_BUFFER_SIZE          (128U)

#define GET_QUEUE_TIMEOUT_MSEC                      (500U)
#define PNP_APP_TIMEOUT_MSEC                        (500U)
#define PNP_MSG_EVENT_QUEUE_MSEC                    (500U)
#define PNP_MSG_EVENT_QUEUE_LENGTH                  (10U)

/************************************************************
 * Static Variables
 ************************************************************/
static cy_mqtt_t                           mqtthandle;
static iot_sample_environment_variables    env_vars;
static az_iot_hub_client                   hub_client;
static char                                mqtt_client_username_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static char                                mqtt_endpoint_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static volatile bool                       connect_state = false;
static uint32_t                            connection_request_id_int = 0;
static char                                connection_request_id_buffer[CONNECTION_REQUEST_ID_BUFFER_SIZE];

#if SAS_TOKEN_AUTH
static iot_sample_credentials              sas_credentials;
static char                                device_id_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static char                                sas_token_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
#endif

/***********************************************************
 * Constants
 ************************************************************/
/* IoT Hub Device Twin Values */
static az_span const twin_desired_name = AZ_SPAN_LITERAL_FROM_STR("desired");
static az_span const twin_version_name = AZ_SPAN_LITERAL_FROM_STR("$version");
static az_span const twin_success_name = AZ_SPAN_LITERAL_FROM_STR("success");
static az_span const twin_value_name = AZ_SPAN_LITERAL_FROM_STR("value");
static az_span const twin_ack_code_name = AZ_SPAN_LITERAL_FROM_STR("ac");
static az_span const twin_ack_version_name = AZ_SPAN_LITERAL_FROM_STR("av");
static az_span const twin_ack_description_name = AZ_SPAN_LITERAL_FROM_STR("ad");
static az_span const twin_desired_temperature_property_name = AZ_SPAN_LITERAL_FROM_STR("targetTemperature");
static az_span const twin_reported_maximum_temperature_property_name = AZ_SPAN_LITERAL_FROM_STR("maxTempSinceLastReboot");

/* IoT Hub Method (Command) Values */
static az_span const command_getMaxMinReport_name = AZ_SPAN_LITERAL_FROM_STR("getMaxMinReport");
static az_span const command_max_temp_name = AZ_SPAN_LITERAL_FROM_STR("maxTemp");
static az_span const command_min_temp_name = AZ_SPAN_LITERAL_FROM_STR("minTemp");
static az_span const command_avg_temp_name = AZ_SPAN_LITERAL_FROM_STR("avgTemp");
static az_span const command_start_time_name = AZ_SPAN_LITERAL_FROM_STR("startTime");
static az_span const command_end_time_name = AZ_SPAN_LITERAL_FROM_STR("endTime");
static az_span const command_empty_response_payload = AZ_SPAN_LITERAL_FROM_STR("{}");

