Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
/* IoT Hub Telemetry Values */
/* ISO8601 Time Format */
static char const iso_spec_time_format[] = "%Y-%m-%dT%H:%M:%S%z";

/*******************************************************************************
 * Global Variables
 ********************************************************************************/
/* IoT Hub Method (Command) Buffers */
static char command_start_time_value_buffer[COMMAND_START_TIME_VALUE_BUFFER_SIZE];
static char command_end_time_value_buffer[COMMAND_END_TIME_VALUE_BUFFER_SIZE];
static char command_response_payload_buffer[COMMAND_RESPONSE_PAYLOAD_BUFFER_SIZE];

/* PnP Device Values */
static double device_current_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_maximum_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_minimum_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_temperature_summation = DEFAULT_START_TEMP_CELSIUS;
static uint32_t device_temperature_count = DEFAULT_START_TEMP_COUNT;
static double device_average_temperature = DEFAULT_START_TEMP_CELSIUS;

static QueueHandle_t              pnp_msg_event_queue = NULL;

typedef enum pnp_msg_type
{
    device_twin_message = 0,
    device_command_request = 1
}pnp_msg_type_t;

typedef struct pnp_msg_event
{
    pnp_msg_type_t  msg_type;
    az_iot_status status;
    bool is_twin_get;
    az_span command_response_payload;
    az_span message_span;
    az_iot_hub_client_method_request *method_req;
}pnp_msg_event_t;

/* The network buffer must remain valid for the lifetime of the MQTT context. */
static uint8_t                             *buffer = NULL;

/******************************************************************************
 * Function Name: get_request_id
 ******************************************************************************
 * Summary:
 *  Function to get request ID, used during send/receive operations for device
 *  twin property.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  az_span: Represents a "view" over a byte buffer that represents a contiguous
 *  region of memory. It contains a pointer to the start of the byte buffer and
 *  the buffer's size.
 *
 ******************************************************************************/
static az_span get_request_id(void)
{
    az_span remainder;
    az_span out_span = az_span_create(
            (uint8_t*)connection_request_id_buffer, sizeof(connection_request_id_buffer));

    az_result rc = az_span_u32toa(out_span, connection_request_id_int++, &remainder);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("\r\nFailed to get request id: az_result return code 0x%08x.", (unsigned int)rc);
        return (remainder);
    }
    return az_span_slice(out_span, 0, az_span_size(out_span) - az_span_size(remainder));
}

/******************************************************************************
 * Function Name: send_command_response
 ******************************************************************************
 * Summary:
 *  Send methods response to Azure hub.
 *
 * Parameters:
 *  command_request: A method request received from IoT Hub.
 *
 *  status: Azure IoT service status codes.
 *
 *  response: Represents a "view" over a byte buffer that represents a
 *  contiguous region of memory. It contains a pointer to the start of the 
 *  byte buffer and the buffer's size.
 *
 * Return:
 *  void
 ******************************************************************************/
static void send_command_response(
        az_iot_hub_client_method_request const* command_request,
        az_iot_status status,
        az_span response)
{
    az_result rc;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_publish_info_t pub_msg;
    size_t topic_len = 0;

    /* Get the Methods response topic to publish the command response. */
    char methods_response_topic_buffer[METHODS_RESPONSE_TOPIC_BUFFER_SIZE];
    rc = az_iot_hub_client_methods_response_get_publish_topic(
            &hub_client,
            command_request->request_id,
            (uint16_t)status,
            methods_response_topic_buffer,
            sizeof(methods_response_topic_buffer),
            &topic_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR(
                "Failed to get the Methods Response topic: az_result return code 0x%08x.", (unsigned int)rc);
        return;
    }

    /* Publish the command response. */
    memset(&pub_msg, 0x00, sizeof(cy_mqtt_publish_info_t));
    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&methods_response_topic_buffer;
    pub_msg.topic_len = (uint16_t)topic_len;
    pub_msg.payload = (const char *)response._internal.ptr;
    pub_msg.payload_len = (size_t)response._internal.size;

    /* Publish the reported property update.*/
    result = cy_mqtt_publish(mqtthandle, &pub_msg);
    if(CY_RSLT_SUCCESS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_publish completed........\n\r"));
        IOT_SAMPLE_LOG_SUCCESS("\r\nClient published the Command response.");
        IOT_SAMPLE_LOG("Status: %d", status);
        IOT_SAMPLE_LOG_AZ_SPAN("Payload:", response);
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result));
        return;
    }
}

/******************************************************************************
 * Function Name: build_property_payload
 ******************************************************************************
 * Summary:
 *  Function to build JSON format of properties for method feature response.
 *
 * Parameters:
 *  property_count: Number of properties to be reported.
 *
 *  names: Names of properties to be reported.
 *
 *  values: Values of properties to be reported.
 *
 *  times: Start and end time duration.
 *
 *  property_payload: Response message payload.
 *
 *  out_property_payload: Response message payload.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void build_property_payload(
        uint8_t property_count,
        az_span const names[],
        double const values[],
        az_span const times[],
        az_span property_payload,
        az_span* out_property_payload)
{
    az_json_writer jw;
    az_result rc;

    rc = az_json_writer_init(&jw, property_payload, NULL);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
        return;
    }
    rc = az_json_writer_append_begin_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
        return;
    }
    for (uint8_t i = 0; i < property_count; i++)
    {
        rc = az_json_writer_append_property_name(&jw, names[i]);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
        rc = az_json_writer_append_double(&jw, values[i], DOUBLE_DECIMAL_PLACE_DIGITS);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
    }

    if (times != NULL)
    {
        rc = az_json_writer_append_property_name(&jw, command_start_time_name);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
        rc = az_json_writer_append_string(&jw, times[0]);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
        rc = az_json_writer_append_property_name(&jw, command_end_time_name);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
        rc = az_json_writer_append_string(&jw, times[1]);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
            return;
        }
    }

