Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
    rc = az_json_writer_append_end_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload");
        return;
    }
    *out_property_payload = az_json_writer_get_bytes_used_in_destination(&jw);
}

/******************************************************************************
 * Function Name: invoke_getMaxMinReport
 ******************************************************************************
 * Summary:
 *  Function to build method response payload for command invoked by Azure Hub.
 *
 * Parameters:
 *  payload: Payload of message received from Azure hub method invocation.
 *
 *  response: Response message payload.
 *
 *  out_response: Response message payload.
 *
 * Return:
 *  bool
 *
 ******************************************************************************/
static bool invoke_getMaxMinReport(az_span payload, az_span response, az_span* out_response)
{
    int32_t incoming_since_value_len = 0;
    az_result rc;

    /* Parse the `since` field in the payload. */
    az_json_reader jr;
    rc = az_json_reader_init(&jr, payload, NULL);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed az_json_reader_init: az_result return code 0x%08x.", (unsigned int)rc);
        return false;
    }
    rc = az_json_reader_next_token(&jr);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed az_json_reader_next_token: az_result return code 0x%08x.", (unsigned int)rc);
        return false;
    }
    rc = az_json_token_get_string(
            &jr.token,
            command_start_time_value_buffer,
            sizeof(command_start_time_value_buffer),
            &incoming_since_value_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed az_json_token_get_string: az_result return code 0x%08x.", (unsigned int)rc);
        return false;
    }

    /* Set the response payload to error if the `since` value was empty. */
    if (incoming_since_value_len == 0)
    {
        *out_response = command_empty_response_payload;
        return false;
    }

    az_span start_time_span
    = az_span_create((uint8_t*)command_start_time_value_buffer, incoming_since_value_len);

    IOT_SAMPLE_LOG_AZ_SPAN("Start time:", start_time_span);

    /* Get the current time as a string. */
    time_t rawtime;
    struct tm* timeinfo;
    time(&rawtime);
    timeinfo = localtime(&rawtime);
    size_t length = strftime(
            command_end_time_value_buffer,
            sizeof(command_end_time_value_buffer),
            iso_spec_time_format,
            timeinfo);
    az_span end_time_span = az_span_create((uint8_t*)command_end_time_value_buffer, (int32_t)length);

    IOT_SAMPLE_LOG_AZ_SPAN("End Time:", end_time_span);

    /* Build command response message. */
    uint8_t count = 3;
    az_span const names[3] = { command_max_temp_name, command_min_temp_name, command_avg_temp_name };
    double const values[3] = { device_maximum_temperature, device_minimum_temperature, device_average_temperature };
    az_span const times[2] = { start_time_span, end_time_span };

    build_property_payload(count, names, values, times, response, out_response);

    return true;
}

/******************************************************************************
 * Function Name: handle_command_request
 ******************************************************************************
 * Summary:
 *  Handle for Azure hub method invocation.
 *
 * Parameters:
 *  message: MQTT publish/receive information structure.
 *
 *  command_request: A method request received from IoT Hub.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void handle_command_request(cy_mqtt_publish_info_t *message,
        az_iot_hub_client_method_request * command_request)
{
    az_span message_span = az_span_create((uint8_t*)message->payload, message->payload_len);
    pnp_msg_event_t *msg_event = NULL;

    msg_event = (pnp_msg_event_t *) malloc(sizeof(pnp_msg_event_t));
    if(msg_event == NULL)
    {
        IOT_SAMPLE_LOG("Memory not available...");
        return;
    }
    msg_event->msg_type = device_command_request;

    if (az_span_is_content_equal(command_getMaxMinReport_name, command_request->name))
    {
        az_iot_status status;
        az_span command_response_payload = AZ_SPAN_FROM_BUFFER(command_response_payload_buffer);

        /* Invoke command. */
        if (invoke_getMaxMinReport(message_span, command_response_payload, &command_response_payload))
        {
            status = AZ_IOT_STATUS_BAD_REQUEST;
        }
        else
        {
            status = AZ_IOT_STATUS_OK;
        }
        IOT_SAMPLE_LOG_SUCCESS("Client invoked command 'getMaxMinReport'.");
        msg_event->method_req = command_request;
        msg_event->status = status;
        memcpy(&(msg_event->command_response_payload), &command_response_payload, sizeof(az_span));
    }
    else
    {
        IOT_SAMPLE_LOG_AZ_SPAN("Command not supported:", command_request->name);
        msg_event->method_req = command_request;
        msg_event->status = AZ_IOT_STATUS_NOT_FOUND;
        memcpy(&(msg_event->command_response_payload), &command_empty_response_payload, sizeof(az_span));
    }

    TEST_INFO(("Pushing to PNP message(device_command_request) event queue...\n"));
    if( xQueueSend( pnp_msg_event_queue, (void *)&msg_event, pdMS_TO_TICKS(PNP_MSG_EVENT_QUEUE_MSEC) ) != pdPASS )
    {
        TEST_INFO(("Pushing to PNP message event queue failed\n"));
        free(msg_event);
        return;
    }
    TEST_INFO(("Message(device_command_request) queued to PNP message event queue...\n"));
}

/******************************************************************************
 * Function Name: build_property_payload_with_status
 ******************************************************************************
 * Summary:
 *  Function to build JSON format of properties for twin feature response.
 *
 * Parameters:
 *  name: Names of properties to be reported.
 *
 *  value: Values of properties to be reported.
 *
 *  ack_code_value: Value of acknowledgment code.
 *
 *  ack_version_value: Value of acknowledgment version.
 *
 *  ack_description_value: Acknowledgment message value.
 *
 *  property_payload: Message payload for property to be reported.
 *
 *  out_property_payload: Message payload for property to be reported.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void build_property_payload_with_status(
        az_span name,
        double value,
        int32_t ack_code_value,
        int32_t ack_version_value,
        az_span ack_description_value,
        az_span property_payload,
        az_span* out_property_payload)
{
    az_json_writer jw;
    az_result rc;

    rc = az_json_writer_init(&jw, property_payload, NULL);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }

    rc = az_json_writer_append_begin_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_property_name(&jw, name);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_begin_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_property_name(&jw, twin_value_name);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc =  az_json_writer_append_double(&jw, value, DOUBLE_DECIMAL_PLACE_DIGITS);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_property_name(&jw, twin_ack_code_name);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_int32(&jw, ack_code_value);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_property_name(&jw, twin_ack_version_name);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_int32(&jw, ack_version_value);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_property_name(&jw, twin_ack_description_name);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_string(&jw, ack_description_value);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_end_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }
    rc = az_json_writer_append_end_object(&jw);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to build property payload with status");
        return;
    }

