Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
    *out_property_payload = az_json_writer_get_bytes_used_in_destination(&jw);
}

/******************************************************************************
 * Function Name: send_reported_property
 ******************************************************************************
 * Summary:
 *  Function to get device twin topic and report updated property to Azure.
 *
 * Parameters:
 *  name: Name of the device twin property to be sent.
 *
 *  value: Value of the device twin property to be sent.
 *
 *  version: Device twin version.
 *
 *  confirm: Check Status
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void send_reported_property(az_span name, double value, int32_t version, bool confirm)
{
    az_result rc;
    size_t topic_len = 0;
    char reported_property_payload_buffer[128];
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_publish_info_t pub_msg;
    uint8_t count = 1;
    az_span const names[1] = { name };
    double const values[1] = { value };

    /* Get the Twin Patch topic to send a reported property update. */
    char twin_patch_topic_buffer[128];
    rc = az_iot_hub_client_twin_patch_get_publish_topic(
            &hub_client,
            get_request_id(),
            twin_patch_topic_buffer,
            sizeof(twin_patch_topic_buffer),
            &topic_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to get the Twin Patch topic: az_result return code 0x%08x.", (unsigned int)rc);
        return;
    }

    /* Build the updated reported property message. */
    az_span reported_property_payload = AZ_SPAN_FROM_BUFFER(reported_property_payload_buffer);

    if (confirm)
    {
        build_property_payload_with_status(
                name,
                value,
                AZ_IOT_STATUS_OK,
                version,
                twin_success_name,
                reported_property_payload,
                &reported_property_payload);
    }
    else
    {
        build_property_payload(count, names, values, NULL, reported_property_payload, &reported_property_payload);
    }

    /* Publish the reported property update. */
    memset(&pub_msg, 0x00, sizeof(cy_mqtt_publish_info_t));

    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&twin_patch_topic_buffer;
    pub_msg.topic_len = (uint16_t)topic_len;
    pub_msg.payload = (const char *)reported_property_payload._internal.ptr;
    pub_msg.payload_len = (size_t)reported_property_payload._internal.size;

    /* Publish the reported property update. */
    result = cy_mqtt_publish(mqtthandle, &pub_msg);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_publish completed........\n\r"));
        IOT_SAMPLE_LOG_SUCCESS("\r\nClient published the Twin Patch reported property message.");
        IOT_SAMPLE_LOG_AZ_SPAN("\r\nPayload:", reported_property_payload);
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result));
        return;
    }
}

/******************************************************************************
 * Function Name: update_device_temperature_property
 ******************************************************************************
 * Summary:
 *  Function to update device temperature property based on device twin message
 *  from Azure Hub.
 *
 * Parameters:
 *  temperature: Value of temperature property.
 *
 *  out_is_max_temp_changed: Flag for temperature change limit.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void update_device_temperature_property(double temperature, bool* out_is_max_temp_changed)
{
    if (device_maximum_temperature < device_minimum_temperature)
    {
        IOT_SAMPLE_LOG("\r\ndevice_maximum_temperature is less then device_minimum_temperature");
        return;
    }

    *out_is_max_temp_changed = false;
    device_current_temperature = temperature;

    /* Update maximum or minimum temperatures. */
    if (device_current_temperature > device_maximum_temperature)
    {
        device_maximum_temperature = device_current_temperature;
        *out_is_max_temp_changed = true;
    }
    else if (device_current_temperature < device_minimum_temperature)
    {
        device_minimum_temperature = device_current_temperature;
    }

    /* Calculate the new average temperature. */
    device_temperature_count++;
    device_temperature_summation += device_current_temperature;
    device_average_temperature = device_temperature_summation / device_temperature_count;

    IOT_SAMPLE_LOG_SUCCESS("Client updated desired temperature variables locally.");
    IOT_SAMPLE_LOG("Current Temperature: %2f", device_current_temperature);
    IOT_SAMPLE_LOG("Maximum Temperature: %2f", device_maximum_temperature);
    IOT_SAMPLE_LOG("Minimum Temperature: %2f", device_minimum_temperature);
    IOT_SAMPLE_LOG("Average Temperature: %2f", device_average_temperature);
}

/******************************************************************************
 * Function Name: parse_desired_temperature_property
 ******************************************************************************
 * Summary:
 *  Function to process desired temperature property from the device twin
 *  message received from the Azure Hub.
 *
 * Parameters:
 *  message_span: Structure to hold the received message.
 *
 *  is_twin_get: Flag for message event.
 *
 *  out_parsed_temperature: Stores temperature value locally.
 *
 *  out_parsed_version_number: Stores device twin version number.
 *
 * Return:
 *  bool
 *
 ******************************************************************************/
static bool parse_desired_temperature_property(
        az_span message_span,
        bool is_twin_get,
        double* out_parsed_temperature,
        int32_t* out_parsed_version_number)
{
    az_span property = twin_desired_temperature_property_name;

    *out_parsed_temperature = 0.0;
    *out_parsed_version_number = 0;

    /* Parse message_span. */
    az_json_reader jr;
    az_result rc;

    rc = az_json_reader_init(&jr, message_span, NULL);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
        return false;
    }
    rc = az_json_reader_next_token(&jr);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
        return false;
    }
    if (jr.token.kind != AZ_JSON_TOKEN_BEGIN_OBJECT)
    {
        IOT_SAMPLE_LOG(
                "`%.*s` property object not found in device twin GET response.",
                (int)az_span_size(twin_desired_name),
                az_span_ptr(twin_desired_name));
        return false;
    }

    /* Device twin GET response: Parse to the "desired" wrapper if it exists. */
    bool desired_found = false;
    if (is_twin_get)
    {
        rc = az_json_reader_next_token(&jr);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
            return false;
        }
        while (jr.token.kind != AZ_JSON_TOKEN_END_OBJECT)
        {
            if (az_json_token_is_text_equal(&jr.token, twin_desired_name))
            {
                rc = az_json_reader_next_token(&jr);
                if (az_result_failed(rc))
                {
                    IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                    return false;
                }
                desired_found = true;
                break;
            }
            else
            {
                rc = az_json_reader_skip_children(&jr);
                if (az_result_failed(rc))
                {
                    IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                    return false;
                }
            }
            rc = az_json_reader_next_token(&jr);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
        }

        if (!desired_found)
        {
            IOT_SAMPLE_LOG(
                    "`%.*s` property object not found in device twin GET response.",
                    (int)az_span_size(twin_desired_name),
                    az_span_ptr(twin_desired_name));
            return false;
        }
    }

    /* Device twin get response OR desired property response:
     * Parse for the desired temperature property
     */
    bool temp_found = false;
    bool version_found = false;

    rc = az_json_reader_next_token(&jr);
    while (!(temp_found && version_found) && (jr.token.kind != AZ_JSON_TOKEN_END_OBJECT))
    {
        if (az_json_token_is_text_equal(&jr.token, twin_desired_temperature_property_name))
        {
            rc = az_json_reader_next_token(&jr);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
            rc = az_json_token_get_double(&jr.token, out_parsed_temperature);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
            temp_found = true;
        }
        else if (az_json_token_is_text_equal(&jr.token, twin_version_name))
        {
            rc = az_json_reader_next_token(&jr);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
            rc = az_json_token_get_int32(&jr.token, out_parsed_version_number);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
            version_found = true;
        }
        else
        {
            rc = az_json_reader_skip_children(&jr);
            if (az_result_failed(rc))
            {
                IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
                return false;
            }
        }
        rc = az_json_reader_next_token(&jr);
        if (az_result_failed(rc))
        {
            IOT_SAMPLE_LOG_ERROR("Failed to parse_desired_temperature_property");
            return false;
        }
    }

    if (temp_found && version_found)
    {
        IOT_SAMPLE_LOG(
                "Parsed desired `%.*s`: %2f",
                (int)az_span_size(property),
                az_span_ptr(property),
                *out_parsed_temperature);
        IOT_SAMPLE_LOG(
                "Parsed `%.*s` number: %d",
                (int)az_span_size(twin_version_name),
                az_span_ptr(twin_version_name),
                (int)*out_parsed_version_number);
    }
    else
    {
        IOT_SAMPLE_LOG(
                "Either `%.*s` or `%.*s` were not found in desired property response.",
                (int)az_span_size(property),
                az_span_ptr(property),
                (int)az_span_size(twin_version_name),
                az_span_ptr(twin_version_name));
        return false;
    }

