Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
    return true;
}

/******************************************************************************
 * Function Name: process_device_twin_message
 ******************************************************************************
 * Summary:
 *  Function to process the device twin message received from the Azure Hub.
 *
 * Parameters:
 *  message_span: Structure to hold the received message.
 *
 *  is_twin_get: Flag for message event.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void process_device_twin_message(az_span message_span, bool is_twin_get)
{
    double desired_temperature;
    int32_t version_number;

    /* Parse for the desired temperature property. */
    if (parse_desired_temperature_property(
            message_span, is_twin_get, &desired_temperature, &version_number))
    {
        IOT_SAMPLE_LOG(" "); /* Formatting */
        bool confirm = true;
        bool is_max_temp_changed = false;
        /* Update device temperature locally and report update to server. */
        update_device_temperature_property(desired_temperature, &is_max_temp_changed);
        send_reported_property(twin_desired_temperature_property_name, desired_temperature, version_number, confirm);
        if(is_max_temp_changed)
        {
            confirm = false;
            send_reported_property(twin_reported_maximum_temperature_property_name, device_maximum_temperature, -1, confirm);
        }
    }
}

/******************************************************************************
 * Function Name: handle_device_twin_message
 ******************************************************************************
 * Summary:
 *  Handle for Device Twin type message.
 *
 * Parameters:
 *  message: MQTT publish information structure.
 *
 *  twin_response: Structure for Twin response.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void handle_device_twin_message(cy_mqtt_publish_info_t *message,
        az_iot_hub_client_twin_response *twin_response)
{
    az_span message_span = az_span_create((uint8_t*)message->payload, message->payload_len);
    pnp_msg_event_t *msg_event = NULL;

    msg_event = (pnp_msg_event_t *) malloc(sizeof(pnp_msg_event_t));
    if(msg_event == NULL)
    {
        IOT_SAMPLE_LOG("Memory not available...");
        return;
    }
    msg_event->msg_type = device_twin_message;

    /* Invoke appropriate action per response type (3 types only). */
    switch(twin_response->response_type)
    {
    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_GET:
        IOT_SAMPLE_LOG("Message Type: GET");
        memcpy(&(msg_event->message_span), &message_span, sizeof(az_span));
        msg_event->is_twin_get = true;
        break;

    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_REPORTED_PROPERTIES:
        IOT_SAMPLE_LOG("Message Type: Reported Properties");
        free(msg_event);
        msg_event = NULL;
        break;

    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_DESIRED_PROPERTIES:
        IOT_SAMPLE_LOG("Message Type: Desired Properties");
        memcpy(&(msg_event->message_span), &message_span, sizeof(az_span));
        msg_event->is_twin_get = false;
        break;
    }

    if(msg_event != NULL)
    {
        TEST_INFO(("Pushing to PNP message(device_twin_message) event queue...\n"));
        if( xQueueSend( pnp_msg_event_queue, (void *)&msg_event, pdMS_TO_TICKS(PNP_MSG_EVENT_QUEUE_MSEC) ) != pdPASS )
        {
            TEST_INFO(("Pushing to PNP message event queue failed with Error\n"));
            free(msg_event);
            return;
        }
        TEST_INFO(("Message(device_twin_message) queued to PNP message event queue...\n"));
    }
}

/******************************************************************************
 * Function Name: on_message_received
 ******************************************************************************
 * Summary:
 *  Function to handle the method invocation or device twin message from the
 *  Azure Hub.
 *
 * Parameters:
 *  topic: Topic of the received message.
 *
 *  topic_len: Topic length of the received message.
 *
 *  message: MQTT publish/subscribe information structure.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void on_message_received(char* topic, uint16_t topic_len, cy_mqtt_publish_info_t *message)
{
    az_result rc;

    az_span const topic_span = az_span_create((uint8_t*)topic, topic_len);
    az_span const message_span = az_span_create((uint8_t*)message->payload, message->payload_len);

    az_iot_hub_client_twin_response twin_response;
    az_iot_hub_client_method_request command_request;

    /* Parse the incoming message topic and handle appropriately. */
    rc = az_iot_hub_client_twin_parse_received_topic(&hub_client, topic_span, &twin_response);
    if (az_result_succeeded(rc))
    {
        IOT_SAMPLE_LOG_SUCCESS("Client received a valid topic response.");
        IOT_SAMPLE_LOG_AZ_SPAN("Topic:", topic_span);
        IOT_SAMPLE_LOG_AZ_SPAN("Payload:", message_span);
        IOT_SAMPLE_LOG("Status: %d", twin_response.status);
        handle_device_twin_message(message, &twin_response);
    }
    else
    {
        rc = az_iot_hub_client_methods_parse_received_topic(&hub_client, topic_span, &command_request);
        if (az_result_succeeded(rc))
        {
            IOT_SAMPLE_LOG_SUCCESS("Client received a valid topic response.");
            IOT_SAMPLE_LOG_AZ_SPAN("Topic:", topic_span);
            IOT_SAMPLE_LOG_AZ_SPAN("Payload:", message_span);
            handle_command_request(message, &command_request);
        }
        else
        {
            IOT_SAMPLE_LOG_ERROR("Message from unknown topic: az_result return code 0x%08x.", (unsigned int)rc);
            IOT_SAMPLE_LOG_AZ_SPAN("Topic:", topic_span);
        }
    }
}

/******************************************************************************
 * Function Name: mqtt_event_cb
 ******************************************************************************
 * Summary:
 *  Callback for MQTT type events.
 *
 * Parameters:
 *  mqtt_handle: Handle to MQTT instance.
 *
 *  event: MQTT event information structure.
 *
 *  arg:
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void mqtt_event_cb(cy_mqtt_t mqtt_handle, cy_mqtt_event_t event, void *arg)
{
    cy_mqtt_publish_info_t *received_msg;

    TEST_INFO(("\r\nMQTT App callback with handle : %p \n", mqtt_handle));

