Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
    switch(event.type)
    {
    case CY_MQTT_EVENT_TYPE_DISCONNECT :
        if(event.data.reason == CY_MQTT_DISCONN_TYPE_BROKER_DOWN)
        {
            TEST_INFO(("\r\nCY_MQTT_DISCONN_TYPE_BROKER_DOWN .....\n"));
        }
        else
        {
            TEST_INFO(("\r\nCY_MQTT_DISCONN_REASON_NETWORK_DISCONNECTION .....\n"));
        }
        connect_state = false;
        break;

    case CY_MQTT_EVENT_TYPE_PUBLISH_RECEIVE :
        received_msg = &(event.data.pub_msg.received_message);
        TEST_INFO(("\r\nMessage received from broker...\n"));
        on_message_received((char*)received_msg->topic, received_msg->topic_len, received_msg);
        break;

    default :
        TEST_INFO(("\r\nUnknown Event .....\n"));
        break;
    }
}

/******************************************************************************
 * Function Name: disconnect_and_delete_mqtt_client
 ******************************************************************************
 * Summary:
 *  Function to disconnect and delete MQTT client.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t disconnect_and_delete_mqtt_client(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    result = cy_mqtt_disconnect(mqtthandle);
    if(CY_RSLT_SUCCESS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_disconnect ----------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_disconnect ----------------------- Fail \n"));
    }
    connect_state = false;
    result = cy_mqtt_delete(mqtthandle);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_delete --------------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_delete --------------------------- Fail \n"));
    }

    result = cy_mqtt_deinit();
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_deinit --------------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_deinit --------------------------- Fail \n"));
    }

    /* Free the network buffer */
    if(buffer != NULL)
    {
        free(buffer);
        buffer = NULL;
    }

    return result;
}

/******************************************************************************
 * Function Name: request_device_twin_document
 ******************************************************************************
 * Summary:
 *  Function to request device twin from the Azure hub.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t request_device_twin_document(void)
{
    int rc;
    uint16_t topic_len = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_publish_info_t pub_msg;
    char twin_document_topic_buffer[128];

    memset(&pub_msg, 0x00, sizeof(cy_mqtt_publish_info_t));
    memset(&twin_document_topic_buffer, 0x00, sizeof(twin_document_topic_buffer));
    IOT_SAMPLE_LOG("Client requesting device twin document from service.");

    rc = az_iot_hub_client_twin_document_get_publish_topic(
            &hub_client,
            get_request_id(),
            twin_document_topic_buffer,
            sizeof(twin_document_topic_buffer),
            (size_t *)&topic_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR(
                "Failed to get the Twin Document topic: az_result return code 0x%08x.", rc);
        exit(rc);
    }
    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&twin_document_topic_buffer;
    pub_msg.topic_len = topic_len;
    pub_msg.payload = (const char *)NULL;
    pub_msg.payload_len = (size_t)0;

    /* Publish the twin document request. */
    result = cy_mqtt_publish(mqtthandle, &pub_msg);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_publish completed........\n\r"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result));
        return result;
    }
    return result;
}

/******************************************************************************
 * Function Name: subscribe_mqtt_client_to_iot_hub_topics
 ******************************************************************************
 * Summary:
 *  Function to subscribe to methods and Twin topic.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield
 *
 ******************************************************************************/
static cy_rslt_t subscribe_mqtt_client_to_iot_hub_topics(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_subscribe_info_t sub_msg[1];

    /* Messages received on the Methods topic will be commands to be invoked. */
    sub_msg[0].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[0].topic = AZ_IOT_HUB_CLIENT_METHODS_SUBSCRIBE_TOPIC;
    sub_msg[0].topic_len = ((uint16_t) (sizeof(AZ_IOT_HUB_CLIENT_METHODS_SUBSCRIBE_TOPIC) - 1));
    result = cy_mqtt_subscribe(mqtthandle, &sub_msg[0], 1);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Fail \n"));
    }

    /* Messages received on the Twin Patch topic will be updates to the desired
     * properties.
     */
    sub_msg[0].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[0].topic = AZ_IOT_HUB_CLIENT_TWIN_PATCH_SUBSCRIBE_TOPIC;
    sub_msg[0].topic_len = ((uint16_t) (sizeof(AZ_IOT_HUB_CLIENT_TWIN_PATCH_SUBSCRIBE_TOPIC) - 1));
    result = cy_mqtt_subscribe(mqtthandle, &sub_msg[0], 1);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Fail \n"));
    }

    /* Messages received on Twin Response topic will be response statuses
     * from the server. */
    sub_msg[0].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[0].topic = AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_SUBSCRIBE_TOPIC;
    sub_msg[0].topic_len = ((uint16_t) (sizeof(AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_SUBSCRIBE_TOPIC) - 1));
    result = cy_mqtt_subscribe(mqtthandle, &sub_msg[0], 1);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_subscribe ------------------------ Fail \n"));
    }
    return result;
}

