Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
/******************************************************************************
 * Function Name: connect_mqtt_client_to_iot_hub
 ******************************************************************************
 * Summary:
 *  Function to establish MQTT connection to Azure IoT hub.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t connect_mqtt_client_to_iot_hub(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int rc;
    size_t username_len = 0, client_id_len = 0;
    cy_mqtt_connect_info_t connect_info;

    /* Get the MQTT client ID used for the MQTT connection */
    char mqtt_client_id_buffer[MQTT_CLIENT_ID_BUFFER_SIZE];

    memset(&connect_info, 0x00, sizeof(cy_mqtt_connect_info_t));
    memset(&mqtt_client_id_buffer, 0x00, sizeof(mqtt_client_id_buffer));

    rc = az_iot_hub_client_get_client_id(&hub_client, mqtt_client_id_buffer, sizeof(mqtt_client_id_buffer), &client_id_len);
    if(az_result_failed(rc))
    {
        TEST_INFO(("\r\nFailed to get MQTT client id: az_result return code 0x%08x.", rc));
        return TEST_FAIL;
    }

    /* Get the MQTT client user name */
    rc = az_iot_hub_client_get_user_name(&hub_client, mqtt_client_username_buffer,
            sizeof(mqtt_client_username_buffer), &username_len);
    if(az_result_failed(rc))
    {
        TEST_INFO(("\r\nFailed to get MQTT client username: az_result return code 0x%08x.", rc));
        return TEST_FAIL;
    }

    connect_info.client_id = mqtt_client_id_buffer;
    connect_info.client_id_len = client_id_len;
    connect_info.keep_alive_sec = MQTT_KEEP_ALIVE_INTERVAL_SECONDS;
    connect_info.clean_session = false;
    connect_info.will_info = NULL;

#if SAS_TOKEN_AUTH
    connect_info.username = mqtt_client_username_buffer;
    connect_info.password = (char *)sas_credentials.sas_token;
    connect_info.username_len = username_len;
    connect_info.password_len = sas_credentials.sas_token_len;
#else
    connect_info.username = mqtt_client_username_buffer;
    connect_info.password = NULL;
    connect_info.username_len = username_len;
    connect_info.password_len = 0;
#endif

    result = cy_mqtt_connect(mqtthandle, &connect_info);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_connect -------------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_connect -------------------------- Fail \n"));
        return TEST_FAIL;
    }
    connect_state = true;
    return CY_RSLT_SUCCESS;
}

/******************************************************************************
 * Function Name: create_and_configure_mqtt_client
 ******************************************************************************
 * Summary:
 *  Function to configure MQTT client's credentials and hostname for connection
 *  with Azure Hub.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t create_and_configure_mqtt_client(void)
{
    int32_t rc;
    uint16_t ep_size = 0;
    cy_rslt_t result = TEST_PASS;
    cy_awsport_ssl_credentials_t credentials;
    cy_awsport_ssl_credentials_t *security = NULL;
    cy_mqtt_broker_info_t broker_info;

    memset(&mqtt_endpoint_buffer, 0x00, sizeof(mqtt_endpoint_buffer));

    ep_size = iot_sample_create_mqtt_endpoint(CY_MQTT_IOT_HUB, &env_vars,
            mqtt_endpoint_buffer,
            sizeof(mqtt_endpoint_buffer));

    /* Initialize the hub client with the default connection options */
    rc = az_iot_hub_client_init(&hub_client, env_vars.hub_hostname, env_vars.hub_device_id, NULL);
    if(az_result_failed(rc))
    {
        TEST_INFO(("\r\nFailed to initialize hub client: az_result return code 0x%08x.", (unsigned int)rc));
        return TEST_FAIL;
    }

    /* Allocate the network buffer */
    buffer = (uint8_t *) malloc(sizeof(uint8_t) * NETWORK_BUFFER_SIZE);
    if(buffer == NULL)
    {
        TEST_INFO(("\r\nNo memory is available for network buffer..! \n"));
        return TEST_FAIL;
    }

    memset(&broker_info, 0x00, sizeof(cy_mqtt_broker_info_t));
    memset(&credentials, 0x00, sizeof(cy_awsport_ssl_credentials_t));

    result = cy_mqtt_init();
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_init ----------------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_init ----------------------------- Fail \n"));
        return TEST_FAIL;
    }

#if SAS_TOKEN_AUTH
    credentials.client_cert = (const char *)NULL;
    credentials.client_cert_size = 0;
    credentials.private_key = (const char *)NULL;
    credentials.private_key_size = 0;
    credentials.root_ca = (const char *) NULL;
    credentials.root_ca_size = 0;
    /* For SAS token based auth mode, RootCA verification is not required. */
    credentials.root_ca_verify_mode = CY_AWS_ROOTCA_VERIFY_NONE;
    /* Set cert and key location. */
    credentials.cert_key_location = CY_AWS_CERT_KEY_LOCATION_RAM;
    credentials.root_ca_location = CY_AWS_CERT_KEY_LOCATION_RAM;
#else
    credentials.client_cert = (const char *) &azure_client_cert;
    credentials.client_cert_size = IOT_AZURE_CLIENT_CERT_LENGTH;
    credentials.private_key = (const char *) &azure_client_key;
    credentials.private_key_size = IOT_AZURE_CLIENT_KEY_LENGTH;
    credentials.root_ca = (const char *) &azure_root_ca_certificate;
    credentials.root_ca_size = IOT_AZURE_ROOT_CA_LENGTH;
#endif

    broker_info.hostname = (const char *)&mqtt_endpoint_buffer;
    broker_info.hostname_len = ep_size;
    broker_info.port = IOT_DEMO_PORT_AZURE_S;
    security = &credentials;

    result = cy_mqtt_create( buffer, NETWORK_BUFFER_SIZE,
            security, &broker_info,"TEST",
            &mqtthandle );
    result = cy_mqtt_register_event_callback(mqtthandle, mqtt_event_cb, NULL);
    if(TEST_PASS == result)
    {
        TEST_INFO(("\r\ncy_mqtt_create ----------------------------- Pass \n"));
    }
    else
    {
        TEST_INFO(("\r\ncy_mqtt_create ----------------------------- Fail \n"));
        return TEST_FAIL;
    }

    return CY_RSLT_SUCCESS;
}

