Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
/******************************************************************************
 * Function Name: configure_hub_environment_variables
 ******************************************************************************
 * Summary:
 *  Configure MQTT hub environment variables like device ID and hostname endpoint.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t configure_hub_environment_variables(void)
{
    cy_rslt_t result = TEST_PASS;
#if SAS_TOKEN_AUTH
    env_vars.hub_device_id._internal.ptr = (uint8_t*) sas_credentials.device_id;
    env_vars.hub_device_id._internal.size = (int32_t) sas_credentials.device_id_len;
    env_vars.hub_sas_key._internal.ptr = (uint8_t*) sas_credentials.sas_token;
    env_vars.hub_sas_key._internal.size = (int32_t) sas_credentials.sas_token_len;
#else
    env_vars.hub_device_id._internal.ptr = (uint8_t*) MQTT_CLIENT_IDENTIFIER_AZURE_CERT;
    env_vars.hub_device_id._internal.size = MQTT_CLIENT_IDENTIFIER_AZURE_CERT_LENGTH;
    env_vars.hub_sas_key._internal.ptr = NULL;
    env_vars.hub_sas_key._internal.size = 0;
#endif
    env_vars.hub_hostname._internal.ptr = (uint8_t*) IOT_DEMO_SERVER_AZURE;
    env_vars.hub_hostname._internal.size = strlen(IOT_DEMO_SERVER_AZURE);
    env_vars.sas_key_duration_minutes = SAS_KEY_DURATION_MINUTES;
    return result;
}

/******************************************************************************
 * Function Name: Azure_Device_Demo_app
 ******************************************************************************
 * Summary:
 *  Task to establish connection to Azure IoT hub and demonstrate it's
 *  Plug and Play feature.
 *
 * Parameters:
 *  arg
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void Azure_hub_pnp_app(void *arg)
{
    cy_rslt_t TestRes = TEST_PASS ;
    uint8_t Failcount = 0, Passcount = 0;
    uint32_t time_ms = 0;
    cy_log_init(CY_LOG_ERR, NULL, NULL);
    pnp_msg_event_t *msg_event = NULL;
#ifdef CY_TFM_PSA_SUPPORTED
    psa_status_t uxStatus = PSA_SUCCESS;
    size_t read_len = 0;
    (void)uxStatus;
    (void)read_len;
#endif

    cy_log_init( CY_LOG_ERR, NULL, NULL );

    /* Initialize the queue for hub methods events. */
    pnp_msg_event_queue = xQueueCreate( PNP_MSG_EVENT_QUEUE_LENGTH, sizeof( unsigned long ) );
    if(pnp_msg_event_queue != NULL)
    {
        TEST_INFO(("pnp_msg_event_queue create ----------- Pass\n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("pnp_msg_event_queue create ----------- Fail\n"));
        Failcount++;
        goto exit;
    }

#if SAS_TOKEN_AUTH
    (void)device_id_buffer;
    (void)sas_token_buffer;
#if ( (defined CY_TFM_PSA_SUPPORTED) && ( SAS_TOKEN_LOCATION_FLASH == false ) )
    /* Read the Device ID from the secured memory */
    uxStatus = psa_ps_get( PSA_DEVICEID_UID, 0, sizeof(device_id_buffer), device_id_buffer, &read_len );
    if( uxStatus == PSA_SUCCESS )
    {
        device_id_buffer[read_len] = '\0';
        TEST_INFO(( "\r\nRetrieved Device ID : %s\r\n", device_id_buffer ));
        sas_credentials.device_id = (uint8_t*)device_id_buffer;
        sas_credentials.device_id_len = read_len;
    }
    else
    {
        TEST_INFO(( "\r\npsa_ps_get for Device ID failed with %d\n", (int)uxStatus ));
        TEST_INFO(( "\r\nTaken Device ID from MQTT_CLIENT_IDENTIFIER_AZURE_SAS macro. \n" ));
        sas_credentials.device_id = (uint8_t*)MQTT_CLIENT_IDENTIFIER_AZURE_SAS;
        sas_credentials.device_id_len = MQTT_CLIENT_IDENTIFIER_AZURE_SAS_LENGTH;
    }

    read_len = 0;

    /* Read the SAS token from the secured memory */
    uxStatus = psa_ps_get( PSA_SAS_TOKEN_UID, 0, sizeof(sas_token_buffer), sas_token_buffer, &read_len );
    if( uxStatus == PSA_SUCCESS )
    {
        sas_token_buffer[read_len] = '\0';
        TEST_INFO(( "\r\nRetrieved SAS token : %s\r\n", sas_token_buffer ));
        sas_credentials.sas_token = (uint8_t*)sas_token_buffer;
        sas_credentials.sas_token_len = read_len;
    }
    else
    {
        TEST_INFO(( "\r\npsa_ps_get for sas_token failed with %d\n", (int)uxStatus ));
        TEST_INFO(( "\r\nTaken SAS Token from IOT_AZURE_PASSWORD macro. \n" ));
        sas_credentials.sas_token = (uint8_t *)IOT_AZURE_PASSWORD;
        sas_credentials.sas_token_len = IOT_AZURE_PASSWORD_LENGTH;
    }
#else
    sas_credentials.device_id = (uint8_t*) MQTT_CLIENT_IDENTIFIER_AZURE_SAS;
    sas_credentials.device_id_len = MQTT_CLIENT_IDENTIFIER_AZURE_SAS_LENGTH;
    sas_credentials.sas_token = (uint8_t*) IOT_AZURE_PASSWORD;
    sas_credentials.sas_token_len = IOT_AZURE_PASSWORD_LENGTH;
#endif

#endif /* SAS_TOKEN_AUTH */

    TestRes = configure_hub_environment_variables();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\nconfigure_environment_variables ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\nconfigure_environment_variables ----------- Fail \n"));
        Failcount++;
    }

    TestRes = create_and_configure_mqtt_client();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\ncreate_and_configure_mqtt_client ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\ncreate_and_configure_mqtt_client ----------- Fail \n"));
        Failcount++;
    }

    TestRes = connect_mqtt_client_to_iot_hub();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\nconnect_mqtt_client_to_iot_hub ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\nconnect_mqtt_client_to_iot_hub ----------- Fail \n"));
        Failcount++;
    }

    TestRes = subscribe_mqtt_client_to_iot_hub_topics();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\nsubscribe_mqtt_client_to_iot_hub_topics ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\nsubscribe_mqtt_client_to_iot_hub_topics ----------- Fail \n"));
        Failcount++;
    }

