Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_hub_pnp.c
    TestRes = request_device_twin_document();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\nrequest_device_twin_document ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\nrequest_device_twin_document ----------- Fail \n"));
        Failcount++;
    }

    /* Delay Loop for Azure hub pnp app task */
    time_ms = ( MESSAGE_WAIT_LOOP_DURATION_MSEC );
    while((connect_state) && (time_ms > 0))
    {
        if(xQueueReceive( pnp_msg_event_queue, (void *)&msg_event, pdMS_TO_TICKS(GET_QUEUE_TIMEOUT_MSEC) ) != pdPASS)
        {
            /* No need to do anything */
        }
        else
        {
            if(msg_event != NULL)
            {
                if(msg_event->msg_type == device_twin_message)
                {
                    process_device_twin_message(msg_event->message_span, msg_event->is_twin_get);
                }
                else if(msg_event->msg_type == device_command_request)
                {
                    send_command_response(msg_event->method_req, msg_event->status, msg_event->command_response_payload);
                }
                else
                {
                    TEST_INFO(("\r\nInvalid PNP event message type... \n"));
                }

                free(msg_event);
                msg_event = NULL;
            }
        }
        time_ms = time_ms - PNP_APP_TIMEOUT_MSEC;
    }

    exit :

    printf("################################\n"
            "PnP (Plug and Play demo Ends\n"
            "################################\n");

    TestRes = disconnect_and_delete_mqtt_client();
    if(TEST_PASS == TestRes)
    {
        TEST_INFO(("\r\ndisconnect_and_delete_mqtt_client ----------- Pass \n"));
        Passcount++;
    }
    else
    {
        TEST_INFO(("\r\ndisconnect_and_delete_mqtt_client ----------- Fail \n"));
        Failcount++;
    }

    TEST_INFO(("\r\nCompleted MQTT Client Test Cases --------------------------\n"));
    TEST_INFO(("\r\nTotal Test Cases   ---------------------- %d\n", (Failcount + Passcount)));
    TEST_INFO(("\r\nTest Cases passed  ---------------------- %d\n", Passcount));
    TEST_INFO(("\r\nTest Cases failed  ---------------------- %d\n", Failcount));

    vTaskSuspend(NULL);

}

/* [] END OF FILE */
